app/controllers/sessions_controller.rb

  def create
    @user =User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "The_Doctor13"], ["LIMIT", 1]]