app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("cellphone", "last_name", "first_name", "email", "created_at", "updated_at", "password_digest", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Newguy"], ["updated_at", "2020-11-13 20:48:05.098917"], ["id", 1]]